#########################################
# 地域名の定義
#########################################

#ファイルにある地域の形式のパターンを先に調べて把握する
#その並びになっているかを入力時にチェック
#本ファイル内での一意性のみを担保するキーワードを
#定義しておいて、そのキーワードに置き換える

# 当該キーワードをデータベース化して、
# 他の地域のコード（総務省等）に紐づけする

# area_name_vxxx_DB_format
# area_name_vxxx_DB
# を１対の組み合わせで管理

# 新しい仕組みを考える場合
# 元のフォーマットは「北区」等が複数出現するので
# ワードでだけではなく、並びに意味をもたせる処理をすること


#################################
# 新しいバージョン(v002)
#################################

# v002の並びを定義
area_name_v002_DB_format <- c(
  "大阪府",
  "大阪市地域",
  "北大阪地域",
  "三島地域",
  "豊能地域",
  "東大阪地域",
  "北河内地域",
  "中河内地域",
  "南河内地域",
  "泉州地域",
  "泉北地域",
  "泉南地域",
  "大阪市",
  "都島区",
  "福島区",
  "此花区",
  "西区",
  "港区",
  "大正区",
  "天王寺区",
  "浪速区",
  "西淀川区",
  "東淀川区",
  "東成区",
  "生野区",
  "旭区",
  "城東区",
  "阿倍野区",
  "住吉区",
  "東住吉区",
  "西成区",
  "淀川区",
  "鶴見区",
  "住之江区",
  "平野区",
  "北区",
  "中央区",
  "堺市",
  "堺区",
  "中区",
  "東区",
  "西区",
  "南区",
  "北区",
  "美原区",
  "岸和田市",
  "豊中市",
  "池田市",
  "吹田市",
  "泉大津市",
  "高槻市",
  "貝塚市",
  "守口市",
  "枚方市",
  "茨木市",
  "八尾市",
  "泉佐野市",
  "富田林市",
  "寝屋川市",
  "河内長野市",
  "松原市",
  "大東市",
  "和泉市",
  "箕面市",
  "柏原市",
  "羽曳野市",
  "門真市",
  "摂津市",
  "高石市",
  "藤井寺市",
  "東大阪市",
  "泉南市",
  "四條畷市",
  "交野市",
  "大阪狭山市",
  "阪南市",
  "島本町",
  "豊能町",
  "能勢町",
  "忠岡町",
  "熊取町",
  "田尻町",
  "岬町",
  "太子町",
  "河南町",
  "千早赤阪村"
)

# v002一意のキーワードを定義
area_name_v002_DB <-
  c("大阪府全市町村",
    "大阪市地域",
    "北大阪地域",
    "三島地域",
    "豊能地域",
    "東大阪地域",
    "北河内地域",
    "中河内地域",
    "南河内地域",
    "泉州地域",
    "泉北地域",
    "泉南地域",
    "大阪市全区",
    "大阪市都島区",
    "大阪市福島区",
    "大阪市此花区",
    "大阪市西区",
    "大阪市港区",
    "大阪市大正区",
    "大阪市天王寺区",
    "大阪市浪速区",
    "大阪市西淀川区",
    "大阪市東淀川区",
    "大阪市東成区",
    "大阪市生野区",
    "大阪市旭区",
    "大阪市城東区",
    "大阪市阿倍野区",
    "大阪市住吉区",
    "大阪市東住吉区",
    "大阪市西成区",
    "大阪市淀川区",
    "大阪市鶴見区",
    "大阪市住之江区",
    "大阪市平野区",
    "大阪市北区",
    "大阪市中央区",
    "堺市全区",
    "堺市堺区",
    "堺市中区",
    "堺市東区",
    "堺市西区",
    "堺市南区",
    "堺市北区",
    "堺市美原区",
    "岸和田市",
    "豊中市",
    "池田市",
    "吹田市",
    "泉大津市",
    "高槻市",
    "貝塚市",
    "守口市",
    "枚方市",
    "茨木市",
    "八尾市",
    "泉佐野市",
    "富田林市",
    "寝屋川市",
    "河内長野市",
    "松原市",
    "大東市",
    "和泉市",
    "箕面市",
    "柏原市",
    "羽曳野市",
    "門真市",
    "摂津市",
    "高石市",
    "藤井寺市",
    "東大阪市",
    "泉南市",
    "四條畷市",
    "交野市",
    "大阪狭山市",
    "阪南市",
    "島本町",
    "豊能町",
    "能勢町",
    "忠岡町",
    "熊取町",
    "田尻町",
    "岬町",
    "太子町",
    "河南町",
    "千早赤阪村"
  )


#################################
# 古いバージョン(v001)
#################################

# v001の並びを定義
area_name_v001_DB_format <- c(
  "大阪府",
  "市部",
  "郡部",
  "大阪市地域",
  "北大阪地域",
  "三島地域",
  "豊能地域",
  "東大阪地域",
  "北河内地域",
  "中河内地域",
  "南河内地域",
  "泉州地域",
  "泉北地域",
  "泉南地域",
  "大阪市",
  "都島区",
  "福島区",
  "此花区",
  "西区",
  "港区",
  "大正区",
  "天王寺区",
  "浪速区",
  "西淀川区",
  "東淀川区",
  "東成区",
  "生野区",
  "旭区",
  "城東区",
  "阿倍野区",
  "住吉区",
  "東住吉区",
  "西成区",
  "淀川区",
  "鶴見区",
  "住之江区",
  "平野区",
  "北区",
  "中央区",
  "堺市",
  "堺区",
  "中区",
  "東区",
  "西区",
  "南区",
  "北区",
  "美原区",
  "岸和田市",
  "豊中市",
  "池田市",
  "吹田市",
  "泉大津市",
  "高槻市",
  "貝塚市",
  "守口市",
  "枚方市",
  "茨木市",
  "八尾市",
  "泉佐野市",
  "富田林市",
  "寝屋川市",
  "河内長野市",
  "松原市",
  "大東市",
  "和泉市",
  "箕面市",
  "柏原市",
  "羽曳野市",
  "門真市",
  "摂津市",
  "高石市",
  "藤井寺市",
  "東大阪市",
  "泉南市",
  "四條畷市",
  "交野市",
  "大阪狭山市",
  "阪南市",
  "三島郡",
  "島本町",
  "豊能郡",
  "豊能町",
  "能勢町",
  "泉北郡",
  "忠岡町",
  "泉南郡",
  "熊取町",
  "田尻町",
  "岬町",
  "南河内郡",
  "太子町",
  "河南町",
  "千早赤阪村"
)

# v001一意のキーワードを定義
area_name_v001_DB <-
  c("大阪府全市町村",
    "大阪府市部",
    "大阪府郡部",
    "大阪市地域",
    "北大阪地域",
    "三島地域",
    "豊能地域",
    "東大阪地域",
    "北河内地域",
    "中河内地域",
    "南河内地域",
    "泉州地域",
    "泉北地域",
    "泉南地域",
    "大阪市全区",
    "大阪市都島区",
    "大阪市福島区",
    "大阪市此花区",
    "大阪市西区",
    "大阪市港区",
    "大阪市大正区",
    "大阪市天王寺区",
    "大阪市浪速区",
    "大阪市西淀川区",
    "大阪市東淀川区",
    "大阪市東成区",
    "大阪市生野区",
    "大阪市旭区",
    "大阪市城東区",
    "大阪市阿倍野区",
    "大阪市住吉区",
    "大阪市東住吉区",
    "大阪市西成区",
    "大阪市淀川区",
    "大阪市鶴見区",
    "大阪市住之江区",
    "大阪市平野区",
    "大阪市北区",
    "大阪市中央区",
    "堺市全区",
    "堺市堺区",
    "堺市中区",
    "堺市東区",
    "堺市西区",
    "堺市南区",
    "堺市北区",
    "堺市美原区",
    "岸和田市",
    "豊中市",
    "池田市",
    "吹田市",
    "泉大津市",
    "高槻市",
    "貝塚市",
    "守口市",
    "枚方市",
    "茨木市",
    "八尾市",
    "泉佐野市",
    "富田林市",
    "寝屋川市",
    "河内長野市",
    "松原市",
    "大東市",
    "和泉市",
    "箕面市",
    "柏原市",
    "羽曳野市",
    "門真市",
    "摂津市",
    "高石市",
    "藤井寺市",
    "東大阪市",
    "泉南市",
    "四條畷市",
    "交野市",
    "大阪狭山市",
    "阪南市",
    "三島郡",
    "島本町",
    "豊能郡",
    "豊能町",
    "能勢町",
    "泉北郡",
    "忠岡町",
    "泉南郡",
    "熊取町",
    "田尻町",
    "岬町",
    "南河内郡",
    "太子町",
    "河南町",
    "千早赤阪村"
  )


#########################################
# データ並びのチェック
#########################################

local_check_area_order <- function(correct_names, target_names){

  flag <- TRUE
  # 長さでチェック
  if (length(target_names) != length(correct_names)){
    message(sprintf("input:%d format:%d",length(target_names),length(correct_names)))
    stop("Area length  does not match with format.")

  }else{
    flag <- all(target_names == correct_names)
  }

  if(!flag){
    for(i in seq_along(target_names)){
      if (target_names[i] != correct_names[i]){
        message(sprintf("%10s,%10s",target_names[i],correct_names[i]))
      }
    }
    stop("Area format is something wrong.")
  }
}


check_area_v001_DB <- function(area_names){
  local_check_area_order(area_name_v001_DB_format, area_names)
}

check_area_v002_DB <- function(area_names){
  local_check_area_order(area_name_v002_DB_format, area_names)
}


guess_area_order_DB <- function(target_names){
  if(length(target_names) == length(area_name_v001_DB_format) &&
     all(target_names == area_name_v001_DB_format)) {
    return(area_name_v001_DB)
  }else if(all(target_names == area_name_v002_DB_format)) {
    return(area_name_v002_DB)
  }
  stop("Area does not match with any format.")
}

